baidu/baidu-iot-samples/STM32/B-L475E-IOT01/Drivers/BSP/Components/spirit1/SPIRIT1_Library/Inc/SPIRIT_Regs.h
/** @defgroup CLOCKREC_Register
 * @{
 */

/**
 *  \brief CLOCKREC register
 *  \code
 *   Read Write
 *   Default value: 0x58
 *
 *   7:5 CLK_REC_P_GAIN [2:0]: Clock recovery loop gain (log2)
 *
 *   4   PSTFLT_LEN: Set Postfilter length
 *                       1 - 16 symbols
 *                       0 - 8 symbols
 *
 *   3:0 CLK_REC_I_GAIN[3:0]: Integral gain for the clock recovery loop
 *   \endcode
 */

#define	CLOCKREC_BASE						((uint8_t)0x23) /*!< Gain of clock recovery loop - Postfilter length 0-8 symbols, 1-16 symbols */

/**
 * @}
 */

/** @defgroup AGCCTRL2_Register
 * @{
 */

/**
 *  \brief AGCCTRL2 register
 *  \code
 *   Read Write
 *   Default value: 0x22
 *
 *   7   Reserved
 *
 *   6   FREEZE_ON_STEADY: Enable freezing on steady state
 *                       1 - Enable
 *                       0 - Disable
 *
 *   5   FREEZE_ON_SYNC: Enable freezing on sync detection
 *                       1 - Enable
 *                       0 - Disable
 *
 *   4   START_MAX_ATTENUATION: Start with max attenuation
 *                       1 - Enable
 *                       0 - Disable
 *
 *   3:0  MEAS_TIME[3:0]: Measure time during which the signal peak is detected (according to the formula 12/fxo*2^MEAS_TIME)
 *   \endcode
 */
#define	AGCCTRL2_BASE						((uint8_t)0x24) /*!< AGC freeze strategy, AGC attenuation  strategy, AGC measure time */

#define AGCCTRL2_FREEZE_ON_STEADY_MASK			        ((uint8_t)0x40) /*!< The attenuation settings will be frozen as soon as signal level
										     is betweeen min and max treshold (see AGCCTRL1) */
#define AGCCTRL2_FREEZE_ON_SYNC_MASK				((uint8_t)0x20) /*!< The attenuation settings will be frozen as soon sync word is detected */
#define AGCCTRL2_START_MAX_ATTENUATION_MASK			((uint8_t)0x10) /*!< The AGC algorithm can start with MAX attenuation or MIN attenuation */

/**
 * @}
 */

/** @defgroup AGCCTRL1_Register
 * @{
 */

/**
 *  \brief AGCCTRL1 register
 *  \code
 *   Read Write
 *   Default value: 0x65
 *
 *   7:4   THRESHOLD_HIGH[3:0]: High threshold for the AGC
 *
 *   3:0   THRESHOLD_LOW[3:0]: Low threshold for the AGC
 *   \endcode
 */
#define	AGCCTRL1_BASE						((uint8_t)0x25) /*!< Sets low and high threshold for AGC */

/**
 * @}
 */

/** @defgroup AGCCTRL0_Register
 * @{
 */

/**
 *  \brief AGCCTRL0 register
 *  \code
 *   Read Write
 *   Default value: 0x8A
 *
 *   7   AGC S_ENABLE: Enable AGC
 *                       1 - Enable
 *                       0 - Disable
 *
 *   6   AGC_MODE: Set linear-Binary AGC mode
 *                       1 - Enable
 *                       0 - Disable
 *
 *   5:0 HOLD_TIME[5:0]: Hold time after gain adjustment according to formula 12/fxo*HOLD_TIME
 *   \endcode
 */
#define	AGCCTRL0_BASE						((uint8_t)0x26) /*!< Enables AGC, set AGC algo between linear/binary mode, set hold time
																	to account signal propagation through RX chain */
#define AGCCTRL0_AGC_MASK				        ((uint8_t)0x80) /*!< AGC on/off */
#define AGCCTRL0_AGC_MODE_MASK  				((uint8_t)0x40) /*!< AGC search correct attenuation in binary mode or sequential mode */
#define AGCCTRL0_AGC_MODE_LINEAR				((uint8_t)0x00) /*!< AGC search correct attenuation in sequential mode (recommended) */
#define AGCCTRL0_AGC_MODE_BINARY				((uint8_t)0x40) /*!< AGC search correct attenuation in binary mode */

/**
 * @}
 */

/** @defgroup CHNUM_Register
 * @{
 */

/**
 *  \brief CHNUM  registers
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0     CH_NUM[7:0]: Channel number. This value is multiplied by the channel spacing and added to the
 *                        synthesizer base frequency to generate the actual RF carrier frequency.
 *   \endcode
 */
#define	CHNUM_BASE						((uint8_t)0x6C) /*!< Channel number. This value is multiplied by the channel
										spacing and added to the synthesizer base frequency to generate the actual RF carrier frequency */
/**
 * @}
 */

/** @defgroup AFC_CORR_Register
 * @{
 */

/**
 *  \brief AFC_CORR  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:0   AFC_CORR[7:0]: AFC word of the received packet
 *   \endcode
 */
#define	AFC_CORR_BASE						((uint8_t)(0xC4)) /*!< AFC word of the received packet */

/**
 * @}
 */

/**
 * @}
 */


/** @defgroup Packet_Configuration_Registers
 * @{
 */

/** @defgroup PCKTCTRL4_Register
 * @{
 */

/**
 *  \brief PCKTCTRL4 register
 *  \code
 *   Read Write
 *   Default value: 0x00
 *
 *   7:5   NOT_USED.
 *
 *   4:3   ADDRESS_LEN[1:0]: length of address field in bytes
 *
 *   2:0   control_len[2:0]: length of control field in bytes
 *   \endcode
 */
#define	PCKTCTRL4_BASE						((uint8_t)0x30) /*!< lenghts of address and control field */

#define PCKTCTRL4_ADDRESS_LEN_MASK                              ((uint8_t)0x18)
#define PCKTCTRL4_CONTROL_LEN_MASK                              ((uint8_t)0x07)

/**
 * @}
 */

/** @defgroup PCKTCTRL3_Register
 * @{
 */

/**
 *  \brief PCKTCTRL3 register
 *  \code
 *   Read Write
 *   Default value: 0x07
 *
 *   7:6   PCKT_FRMT[1:0]: format of packet
 *
 *          PCKT_FRMT1       |        PCKT_FRMT0       |        Format
 *       ----------------------------------------------------------------------
 *             0             |           0             |        BASIC
 *             1             |           0             |        MBUS
 *             1             |           1             |        STACK
 *
 *   5:4   RX_MODE[1:0]: length of address 0x30 field in bytes
 *
 *          RX_MODE1       |        RX_MODE0       |            Rx Mode
 *       --------------------------------------------------------------------
 *             0           |           0           |              normal
 *             0           |           1           |       direct through FIFO
 *             1           |           0           |       direct through GPIO
 *
 *   3:0   LEN_WID[3:0]: length of length field in bits
 *   \endcode
 */
#define	PCKTCTRL3_BASE						((uint8_t)0x31) /*!< packet format, RX mode, lenght of length field */

#define	PCKTCTRL3_PCKT_FRMT_BASIC				((uint8_t)0x00) /*!< Basic Packet Format */
#define	PCKTCTRL3_PCKT_FRMT_MBUS				((uint8_t)0x80) /*!< Wireless M-BUS Packet Format */
#define	PCKTCTRL3_PCKT_FRMT_STACK				((uint8_t)0xC0) /*!< STack Packet Format */

